toasterllc/MDCCode/Code/MSP430/MSPApp/main.cpp
        // Start tasks
        _Scheduler::Start<_TaskI2C>();
        
        // Restore our saved power state
        // _OnSaved stores our power state across crashes/LPM3.5, so we need to
        // restore our _On assertion based on it.
        if (_OnSaved) {
            _On = true;
        }
    }
    
    static void Run() {
        _Init();
        
//        for (;;) {
//            _Pin::LED_RED_::Write(1);
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//            _Pin::LED_RED_::Write(0);
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//        }
        
//        _Pin::LED_RED_::Write(1);
//        for (;;) {
//            _Pin::LED_RED_::Write(1);
//            __delay_cycles(1000000);
//            _Pin::LED_RED_::Write(0);
//            __delay_cycles(1000000);
//        }
        
//        for (bool on_=0;; on_=!on_) {
////            _Scheduler::Sleep(_Scheduler::Ms<100>);
//        }
        
//        _On = true;
//        for (bool on_=false;; on_=!on_) {
////            __delay_cycles(1000000);
////            _Pin::LED_GREEN_::Write(on_);
////            _EventTimer::Schedule(_RTC::Now() + 5*Time::TicksFreq::num);
////            _Scheduler::Wait([] { return _EventTimer::Fired(); });
//            
//            const auto nextTime = _Triggers::EventFront()->time;
//            const auto currTime = _RTC::Now();
//            
//            _Scheduler::Sleep(_Scheduler::Ms<1000>);
//        }
        
        
        
//        _On = true;
//        for (bool on_=false;; on_=!on_) {
////            __delay_cycles(1000000);
////            _Pin::LED_GREEN_::Write(on_);
//            _EventTimer::Schedule(_RTC::Now() + 5*Time::TicksFreq::num);
//            _Scheduler::Wait([] { return _EventTimer::Fired(); });
//        }
        
//        for (bool on_=false;; on_=!on_) {
//            _Pin::LED_GREEN_::Write(on_);
//            _Scheduler::Sleep(_Scheduler::Ms<1000>);
//        }
        
//        for (;;) {
//            _Pin::LED_RED_::Write(1);
//            _Pin::LED_GREEN_::Write(1);
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//            
//            if (_Clock::_ClockFaults()) {
//                _Pin::LED_RED_::Write(0);
//            } else {
//                _Pin::LED_GREEN_::Write(0);
//            }
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//        }
        
//        for (;;) {
////            _LEDRed_.set(_LEDPriority::Power, !_LEDRed_.get());
//            _Pin::LED_RED_::Write(0);
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//            
//            _Pin::LED_RED_::Write(1);
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//        }
        
//        for (;;) {
////            _LEDRed_.set(_LEDPriority::Power, !_LEDRed_.get());
//            _Pin::LED_RED_::Write(0);
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//            
//            _Pin::LED_RED_::Write(1);
//            _Scheduler::Sleep(_Scheduler::Ms<100>);
//        }
        
        static bool charging = false;
        for (;;) {
            // Button needs interrupts to be disabled
            Toastbox::IntState ints(false);
            
            // Wait for a button press, or for the charging state to change
            _Button::Reset();
            _Scheduler::Wait([] { return _Button::EventPending() || charging!=_Charging::Charging(); });
            
            // Handle button presses
            if (_Button::EventPending()) {
                switch (_Button::EventRead()) {
                case _Button::Event::Press: {
                    // Ignore button presses if we're off or in host mode
                    if (!_On || _TaskI2C::HostModeEnabled()) break;
                    
                    for (auto it=_Triggers::ButtonTriggerBegin(); it!=_Triggers::ButtonTriggerEnd(); it++) {
                        _TaskEvent::CaptureStart(*it, _RTC::Now());
                    }
                    break;
                }
                
                case _Button::Event::Hold:
                    _On = !_On;
                    break;
                }
            
            // Handle charging state changes
            } else {
                charging = _Charging::Charging();
                // Turn ourself on when we're plugged in
                if (charging) _On = true;
            }
        }
    }
    
    static void Sleep() {
        // Put ourself to sleep until an interrupt occurs
        
        // Enable/disable SysTick depending on whether we have tasks that are waiting for a deadline to pass.
        // We do this to prevent ourself from waking up unnecessarily, saving power.
        _SysTickEnabled = _Scheduler::TickRequired();
        
        // We consider the sleep 'extended' if SysTick isn't needed during the sleep
//        const bool extendedSleep = false;
//        const bool extendedSleep = true;
        const bool extendedSleep = !_SysTickEnabled;
        _Clock::Sleep(extendedSleep);
        
        // Unconditionally enable SysTick while we're awake
        _SysTickEnabled = true;
    }
    
    static void _SysTickEnabledChanged() {
        _SysTick::Enabled(_SysTickEnabled);
    }
    
    static inline T_Property<bool,_SysTickEnabledChanged> _SysTickEnabled;
    
    // Task stack
    static constexpr auto& Stack = _TaskMainStack;
};

// MARK: - IntState

inline bool Toastbox::IntState::Get() {
    return __get_SR_register() & GIE;
}

inline void Toastbox::IntState::Set(bool en) {
    if (en) __bis_SR_register(GIE);
    else    __bic_SR_register(GIE);
}

// MARK: - Sleep

static void _Sleep() {
    _TaskMain::Sleep();
}

// MARK: - Properties

static void _OnChanged() {
    _OnSaved = _On;
    _LEDFlash(_On ? _LEDGreen_ : _LEDRed_);
}

static void _EventsEnabledUpdate() {
    _EventsEnabled = _On && !_TaskI2C::HostModeEnabled();
}

static void _EventsEnabledChanged() {
    if (_EventsEnabled) _TaskEvent::Start();
    else                _TaskEvent::Reset();
}

static void _MotionEnabledUpdate() {
    _MotionEnabled = _EventsEnabled && _MotionRequested::Asserted();
}

